src/InformationRegisters/ШтрихкодыНаПроизводстве/ШтрихкодыНаПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНаПроизводстве</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиНаПроизводстве</types>
    </type>
  </resources>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Процесс</name>
    <type>
      <types>EnumRef.ПроцессНаПроизводстве</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>31</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ШтрихкодыНаПроизводстве/ManagerModule.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура добавляет запись о штрихкоде.
// 
// Параметры:
//  Процесс - ПеречислениеСсылка.ПроцессНаПроизводстве
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
//  Штрихкод - Строка
//  Время - Дата
Процедура ДобавитьШтрихкод(Знач Процесс, Знач Сотрудник, Знач Штрихкод, Знач Время) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Сотрудник = Сотрудник;
    Запись.Штрихкод = Штрихкод;
    Запись.Процесс = Процесс;
    Запись.Дата = Время;

    Запись.Записать();

КонецПроцедуры

// Процедура удаляет запись о штрихкоде.
// 
// Параметры:
//  Процесс - ПеречислениеСсылка.ПроцессНаПроизводстве
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
//  Штрихкод - Строка
Процедура УдалитьШтрихкод(Знач Процесс, Знач Сотрудник, Знач Штрихкод) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Сотрудник = Сотрудник;
    Запись.Штрихкод = Штрихкод;
    Запись.Процесс = Процесс;

    Запись.Удалить();

КонецПроцедуры

// Процедура удаляет записи о штрихкодах сотрудника.
// 
// Параметры:
//  Процесс - ПеречислениеСсылка.ПроцессНаПроизводстве
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
Процедура УдалитьШтрихкодыСотрудника(Знач Процесс, Знач Сотрудник) Экспорт

    НаборЗаписей = СоздатьНаборЗаписей();

    НаборЗаписей.УдалитьДляСотрудника(Сотрудник, Процесс);

КонецПроцедуры

#КонецОбласти
